<?php
/**
 * 获取列表数据
 */
$data = [
	[
		'aid'=>1,
		'title'=>'世界杯-23时揭幕战俄罗斯VS沙特',
		'imgUrl'=>'http://n.sinaimg.cn/sports/transform/250/w150h100/20180614/vDhY-hcwpcmq8434543.jpg',
		'desc'=>'西足协主席:球员愿为耶罗去死 洛佩特吉:仍支持西班牙夺冠
曝皇马砸1亿镑挖德赫亚 给国足一个梅西能在世界杯走多远？
英超赛程:首轮阿森纳vs曼城 厄齐尔伤愈 世界杯小白指南',
	],
	[
		'aid'=>2,
		'title'=>'詹姆斯决定三发布媒体公布',
		'imgUrl'=>'http://n.sinaimg.cn/sports/transform/250/w150h100/20180614/thN_-hcwpcmq8513380.png',
		'desc'=>'前黑八成员炮轰詹皇放弃总决赛G4 勇士球迷神梗再黑詹姆斯
科尔承认库里KD不合拍 裁判官方:勇士预想的4保1战术是犯规
沃神曝火箭也要追泡椒 绿军报价伦纳德遭拒 曝波波2年后退休',
	],
	[
		'aid'=>3,
		'title'=>'世联-23:30直播中国女排vs土耳其',
		'imgUrl'=>'http://n.sinaimg.cn/sports/transform/250/w150h100/20180614/3eIw-hcwpcmq8575068.jpg',
		'desc'=>'雅迪，更高端的电动车 视频 当新浪遇上俄罗斯世界杯
专栏-梅西需要一个世界杯 博客-西班牙换帅C罗从中受益
惊喜or惊吓?俄罗斯命悬它手 抓紧看!智能AI剧透揭幕战',
	],
	
	[
		'aid'=>4,
		'title'=>'央视名嘴名记推演世界杯冠军 你和谁看法相同？',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/162/w650h1112/20180614/nrpx-hcwpcmr0276556.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？央视名嘴名记推演世界杯冠军 你和谁看法相同？',
	],
	
	[
		'aid'=>5,
		'title'=>'中超俱乐部获利世界杯！国安因傲骨可享250万补贴',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/283/w650h433/20180614/bZ-d-fzrwiaz7004267.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'中超俱乐部获利世界杯！国安因傲骨可享250万补贴中超俱乐部获利世界杯！国安因傲骨可享250万补贴中超俱乐部获利世界杯！国安因傲骨可享250万补贴中超俱乐部获利世界杯！国安因傲骨可享250万补贴中超俱乐部获利世界杯！国安因傲骨可享250万补贴',
	],
	
	[
		'aid'=>6,
		'title'=>'浪子帕托重回热恋模式 10年内第5任女友系名模',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/263/w650h413/20180614/Jr_A-hcwpcmq7039352.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'浪子帕托重回热恋模式 10年内第5任女友系名模浪子帕托重回热恋模式 10年内第5任女友系名模浪子帕托重回热恋模式 10年内第5任女友系名模浪子帕托重回热恋模式 10年内第5任女友系名模浪子帕托重回热恋模式 10年内第5任女友系名模',
	],
	
	[
		'aid'=>7,
		'title'=>'林书豪怀念前勇士老大：他曾为我买20条牛仔裤',
		'imgUrl'=>'http://k.sinaimg.cn/n/translate/763/w1000h563/20180614/Zza1-hcwpcmq6239248.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'林书豪怀念前勇士老大：他曾为我买20条牛仔裤林书豪怀念前勇士老大：他曾为我买20条牛仔裤林书豪怀念前勇士老大：他曾为我买20条牛仔裤林书豪怀念前勇士老大：他曾为我买20条牛仔裤',
	],
	
	[
		'aid'=>8,
		'title'=>'费德勒：纳达尔是温网最大对手 盼瓦林卡穆雷回归',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/283/w650h433/20180614/dkVP-hcwpcmq6793982.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'费德勒：纳达尔是温网最大对手 盼瓦林卡穆雷回归费德勒：纳达尔是温网最大对手 盼瓦林卡穆雷回归费德勒：纳达尔是温网最大对手 盼瓦林卡穆雷回归费德勒：纳达尔是温网最大对手 盼瓦林卡穆雷回归',
	],
	
	[
		'aid'=>9,
		'title'=>'女排不敌荷兰，谁责任最大？网友回复一针见血！',
		'imgUrl'=>'http://k.sinaimg.cn/n/sinacn08/40/w480h360/20180614/fc48-hcwpcmq6680069.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'女排不敌荷兰，谁责任最大？网友回复一针见血！女排不敌荷兰，谁责任最大？网友回复一针见血！女排不敌荷兰，谁责任最大？网友回复一针见血！女排不敌荷兰，谁责任最大？网友回复一针见血！',
	],
	
	[
		'aid'=>10,
		'title'=>'皇马愚蠢操作坑惨西班牙队 想清洗C罗却搬石头砸自己脚',
		'imgUrl'=>'http://k.sinaimg.cn/n/sinacn20/40/w480h360/20180613/d17d-hcwpcmq4462226.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'皇马愚蠢操作坑惨西班牙队 想清洗C罗却搬石头砸自己脚皇马愚蠢操作坑惨西班牙队 想清洗C罗却搬石头砸自己脚皇马愚蠢操作坑惨西班牙队 想清洗C罗却搬石头砸自己脚',
	],
	
	[
		'aid'=>11,
		'title'=>'世界杯亚洲已连两次无缘小组出线 两队肩负希望',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/287/w650h437/20180614/fGXD-hcwpcmq7166384.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'世界杯亚洲已连两次无缘小组出线 两队肩负希望世界杯亚洲已连两次无缘小组出线 两队肩负希望世界杯亚洲已连两次无缘小组出线 两队肩负希望世界杯亚洲已连两次无缘小组出线 两队肩负希望世界杯亚洲已连两次无缘小组出线 两队肩负希望',
	],
	
	[
		'aid'=>12,
		'title'=>'2K女神晒美照！底下评论又虐狗又污简直没法看',
		'imgUrl'=>'http://k.sinaimg.cn/n/sports/transform/90/w650h1040/20180614/sKXb-fzrwiaz6997331.jpg/w150h100f1t0l0q100syf.jpg',
		'desc'=>'2K女神晒美照！底下评论又虐狗又污简直没法看2K女神晒美照！底下评论又虐狗又污简直没法看2K女神晒美照！底下评论又虐狗又污简直没法看2K女神晒美照！底下评论又虐狗又污简直没法看2K女神晒美照！底下评论又虐狗又污简直没法看',
	],
];

echo json_encode($data);exit;







