1.代码书写要规范，拼音，英文，中线，下划线，驼峰都可以，但是要保持一致。

2.把父级的class补全，一为了好调试，二是优先级。

3.大块可以采用id，块里面呢可以采用class.

4.做之前首先分析整体网页，心里有底那块是公共样式，把公共样式分离出来，一个为了公用，二为了方便维护。

5.从整体到细节，大块到小块，但是尽量少嵌套，特殊情况特殊对待。

6.margin属性容易在低版本的IE中出现兼容性问题，尽量少用，可以选用padding或position方式代替。

7.在宽高固定、子元素比较多、子元素位置杂乱，子元素类型较多的区域中，尽量用定位方法来做，如果

用margin来做，不同版本IE浏览器下的表现可能会让你崩溃的，但是并不是绝对的。

8.首先你要相信一点，不用所谓的hack技术一样可以写出来浏览器全兼容的页面。调整网页兼容性并不

一定非得用hack技术，有时候需要的仅仅是把代码写的更严谨一些。当然，这需要开发者一定的技术和

经验积累。

9.能设置具体宽高的区块尽量设置具体的宽高。

10.不要用行级标签（a标签、span标签等）和文字标签（p标签等）当做划分区域的标签。

11.深化区块的概念，把页面严格的分成不同的区块，尽量避免不同区块之间的冲突。

12.写页面的时候写一点就测一下兼容性，发现问题及时改正，不要想着等到全写完后统一调试兼容性。

13.如果一种办法IE6不行，赶紧换另一种方法尝试，切勿浪费过多时间。

14.善于用第三方插件工具，截图，取色，firebug,等一些。

15.广告用新窗口打开。

16.标题采用H2标签，利于SEO优化

17.文字可以采用p标签

18.注意关键字不能堆砌太多网站关键字的分布要均匀

19.网站内容保证原创文章

20.保证url地址干净简洁，以html结尾

21.不要将过多的外链都聚集在一个页面上面。

22.足够的耐心，不要心浮气躁，有的时候需要耐心等，千万不要每天去换关键词，去做优化，有的时候就是优化过度。


自学建议：

1.保证兴趣。

2.切换杂乱的学习，一定要有一个目标有一个计划。比如：在一个或者两个星期之内把html学会，而且看视频，一定不要好几家视频混着看，要看只看一家。

3.基础知识点不要一直听，听到那块可以找到相关的例子来做，做会再接着学。

4.给自己出题，然后过1天或者半天再答，越细越好，如果答不上来，就不往后学。

5.多问人，多看论坛。

6.一定要坚持，有特殊情况，最起码保证一个小时来学习。

7.如果自学时间特别长，还是有问题，可以考虑其他途径来学习，或者可以考虑放弃，但是这是最不应走的一步。

bbs.houdunwang.com


马老师联系方式：

QQ：   410004417
邮箱： houdunwangmzy@163.com