<?php
//阿里云消息服务
return [
    /*
    |--------------------------------------------------------------------------
    | 访问MNS的接入地址，登陆MNS控制台 单击右上角 获取Endpoint 查看
    */
    'endPoint'  => 'https://297600.mns.cn-hangzhou.aliyuncs.com/',

    /*
    |--------------------------------------------------------------------------
    | 如果使用主账号访问，登陆阿里云 AccessKey 管理页面创建、查看
    | 如果使用子账号访问，请登录阿里云访问控制控制台查看
    */
    'accessId'  => '',

    /*
    |--------------------------------------------------------------------------
    | 如果使用主账号访问，登陆阿里云 AccessKey 管理页面创建、查看
    | 如果使用子账号访问，请登录阿里云访问控制控制台查看
    */
    'accessKey' => '',

    /*
    |--------------------------------------------------------------------------
    | 短信专用主题
    |--------------------------------------------------------------------------
    |
    | 进入控制台短信概览页，获取主题名称
    */
    'topic'     => 'sms.topic-cn-hangzhou',
];