<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
//第一个参数是定义的路由规则
//第二个参数是该路由规则调用的方法或找的控制器中的方法
Route::get('think', function () {
    return 'hello,houdunren!';
});

//自定义路由规则
Route::get('alist',function (){
    return '我是加载文章列表方法';
});

//定义第二种路由规则
//如果设置了路由器,访问指定方法的时候,就只能通过路由形式访问,不能再使用 模块/控制器/方法名 的方式来访问
Route::get('add','index/article/add');

//Route::get('slist','index/stu/index');


//定义资源路由
//第一个参数是定义路由规则
//第二个参数是该规则去找的控制器名称
//资源路由会自动根据资源路由的定义方式,生成对应的每个方法的请求方式及路由地址
Route::resource('stu','index/Stu');


//如果在定义路由的时候,需要传递一些参数,可以使用:来定义参数
//该参数会自动的被传递给当前路由所调用的方法,作为方法的参数自动被接收
Route::get('hello/:name', 'index/hello');

return [

];
